konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/otp.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : OTP
# Version        : 1
# Bus type       : apb
# Description    : SNPS OTP control IF (SBPI and RPi wrapper control)
# =============================================================================
.ifndef	_HARDWARE_REGS_OTP_H
.set	_HARDWARE_REGS_OTP_H, 1
# =============================================================================
# Register    : OTP_SW_LOCK0
# Description : Software lock register for page 0.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK0_OFFSET, 0x00000000
.equ	OTP_SW_LOCK0_BITS, 0x0000000f
.equ	OTP_SW_LOCK0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK0_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK0_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK0_NSEC_MSB, 3
.equ	OTP_SW_LOCK0_NSEC_LSB, 2
.equ	OTP_SW_LOCK0_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK0_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK0_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK0_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK0_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK0_SEC_MSB, 1
.equ	OTP_SW_LOCK0_SEC_LSB, 0
.equ	OTP_SW_LOCK0_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK0_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK0_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK1
# Description : Software lock register for page 1.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK1_OFFSET, 0x00000004
.equ	OTP_SW_LOCK1_BITS, 0x0000000f
.equ	OTP_SW_LOCK1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK1_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK1_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK1_NSEC_MSB, 3
.equ	OTP_SW_LOCK1_NSEC_LSB, 2
.equ	OTP_SW_LOCK1_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK1_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK1_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK1_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK1_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK1_SEC_MSB, 1
.equ	OTP_SW_LOCK1_SEC_LSB, 0
.equ	OTP_SW_LOCK1_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK1_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK1_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK2
# Description : Software lock register for page 2.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK2_OFFSET, 0x00000008
.equ	OTP_SW_LOCK2_BITS, 0x0000000f
.equ	OTP_SW_LOCK2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK2_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK2_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK2_NSEC_MSB, 3
.equ	OTP_SW_LOCK2_NSEC_LSB, 2
.equ	OTP_SW_LOCK2_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK2_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK2_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK2_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK2_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK2_SEC_MSB, 1
.equ	OTP_SW_LOCK2_SEC_LSB, 0
.equ	OTP_SW_LOCK2_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK2_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK2_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK3
# Description : Software lock register for page 3.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK3_OFFSET, 0x0000000c
.equ	OTP_SW_LOCK3_BITS, 0x0000000f
.equ	OTP_SW_LOCK3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK3_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK3_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK3_NSEC_MSB, 3
.equ	OTP_SW_LOCK3_NSEC_LSB, 2
.equ	OTP_SW_LOCK3_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK3_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK3_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK3_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK3_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK3_SEC_MSB, 1
.equ	OTP_SW_LOCK3_SEC_LSB, 0
.equ	OTP_SW_LOCK3_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK3_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK3_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK4
# Description : Software lock register for page 4.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK4_OFFSET, 0x00000010
.equ	OTP_SW_LOCK4_BITS, 0x0000000f
.equ	OTP_SW_LOCK4_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK4_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK4_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK4_NSEC_MSB, 3
.equ	OTP_SW_LOCK4_NSEC_LSB, 2
.equ	OTP_SW_LOCK4_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK4_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK4_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK4_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK4_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK4_SEC_MSB, 1
.equ	OTP_SW_LOCK4_SEC_LSB, 0
.equ	OTP_SW_LOCK4_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK4_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK4_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK5
# Description : Software lock register for page 5.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK5_OFFSET, 0x00000014
.equ	OTP_SW_LOCK5_BITS, 0x0000000f
.equ	OTP_SW_LOCK5_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK5_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK5_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK5_NSEC_MSB, 3
.equ	OTP_SW_LOCK5_NSEC_LSB, 2
.equ	OTP_SW_LOCK5_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK5_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK5_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK5_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK5_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK5_SEC_MSB, 1
.equ	OTP_SW_LOCK5_SEC_LSB, 0
.equ	OTP_SW_LOCK5_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK5_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK5_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK6
# Description : Software lock register for page 6.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK6_OFFSET, 0x00000018
.equ	OTP_SW_LOCK6_BITS, 0x0000000f
.equ	OTP_SW_LOCK6_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK6_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK6_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK6_NSEC_MSB, 3
.equ	OTP_SW_LOCK6_NSEC_LSB, 2
.equ	OTP_SW_LOCK6_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK6_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK6_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK6_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK6_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK6_SEC_MSB, 1
.equ	OTP_SW_LOCK6_SEC_LSB, 0
.equ	OTP_SW_LOCK6_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK6_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK6_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK7
# Description : Software lock register for page 7.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK7_OFFSET, 0x0000001c
.equ	OTP_SW_LOCK7_BITS, 0x0000000f
.equ	OTP_SW_LOCK7_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK7_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK7_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK7_NSEC_MSB, 3
.equ	OTP_SW_LOCK7_NSEC_LSB, 2
.equ	OTP_SW_LOCK7_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK7_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK7_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK7_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK7_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK7_SEC_MSB, 1
.equ	OTP_SW_LOCK7_SEC_LSB, 0
.equ	OTP_SW_LOCK7_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK7_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK7_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK8
# Description : Software lock register for page 8.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK8_OFFSET, 0x00000020
.equ	OTP_SW_LOCK8_BITS, 0x0000000f
.equ	OTP_SW_LOCK8_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK8_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK8_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK8_NSEC_MSB, 3
.equ	OTP_SW_LOCK8_NSEC_LSB, 2
.equ	OTP_SW_LOCK8_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK8_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK8_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK8_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK8_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK8_SEC_MSB, 1
.equ	OTP_SW_LOCK8_SEC_LSB, 0
.equ	OTP_SW_LOCK8_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK8_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK8_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK9
# Description : Software lock register for page 9.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK9_OFFSET, 0x00000024
.equ	OTP_SW_LOCK9_BITS, 0x0000000f
.equ	OTP_SW_LOCK9_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK9_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK9_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK9_NSEC_MSB, 3
.equ	OTP_SW_LOCK9_NSEC_LSB, 2
.equ	OTP_SW_LOCK9_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK9_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK9_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK9_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK9_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK9_SEC_MSB, 1
.equ	OTP_SW_LOCK9_SEC_LSB, 0
.equ	OTP_SW_LOCK9_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK9_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK9_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK10
# Description : Software lock register for page 10.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK10_OFFSET, 0x00000028
.equ	OTP_SW_LOCK10_BITS, 0x0000000f
.equ	OTP_SW_LOCK10_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK10_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK10_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK10_NSEC_MSB, 3
.equ	OTP_SW_LOCK10_NSEC_LSB, 2
.equ	OTP_SW_LOCK10_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK10_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK10_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK10_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK10_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK10_SEC_MSB, 1
.equ	OTP_SW_LOCK10_SEC_LSB, 0
.equ	OTP_SW_LOCK10_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK10_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK10_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK11
# Description : Software lock register for page 11.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK11_OFFSET, 0x0000002c
.equ	OTP_SW_LOCK11_BITS, 0x0000000f
.equ	OTP_SW_LOCK11_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK11_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK11_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK11_NSEC_MSB, 3
.equ	OTP_SW_LOCK11_NSEC_LSB, 2
.equ	OTP_SW_LOCK11_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK11_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK11_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK11_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK11_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK11_SEC_MSB, 1
.equ	OTP_SW_LOCK11_SEC_LSB, 0
.equ	OTP_SW_LOCK11_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK11_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK11_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK12
# Description : Software lock register for page 12.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK12_OFFSET, 0x00000030
.equ	OTP_SW_LOCK12_BITS, 0x0000000f
.equ	OTP_SW_LOCK12_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK12_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK12_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK12_NSEC_MSB, 3
.equ	OTP_SW_LOCK12_NSEC_LSB, 2
.equ	OTP_SW_LOCK12_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK12_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK12_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK12_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK12_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK12_SEC_MSB, 1
.equ	OTP_SW_LOCK12_SEC_LSB, 0
.equ	OTP_SW_LOCK12_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK12_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK12_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK13
# Description : Software lock register for page 13.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK13_OFFSET, 0x00000034
.equ	OTP_SW_LOCK13_BITS, 0x0000000f
.equ	OTP_SW_LOCK13_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK13_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK13_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK13_NSEC_MSB, 3
.equ	OTP_SW_LOCK13_NSEC_LSB, 2
.equ	OTP_SW_LOCK13_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK13_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK13_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK13_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK13_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK13_SEC_MSB, 1
.equ	OTP_SW_LOCK13_SEC_LSB, 0
.equ	OTP_SW_LOCK13_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK13_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK13_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK14
# Description : Software lock register for page 14.
#
