konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/otp.inc
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK14_OFFSET, 0x00000038
.equ	OTP_SW_LOCK14_BITS, 0x0000000f
.equ	OTP_SW_LOCK14_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK14_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK14_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK14_NSEC_MSB, 3
.equ	OTP_SW_LOCK14_NSEC_LSB, 2
.equ	OTP_SW_LOCK14_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK14_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK14_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK14_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK14_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK14_SEC_MSB, 1
.equ	OTP_SW_LOCK14_SEC_LSB, 0
.equ	OTP_SW_LOCK14_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK14_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK14_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK15
# Description : Software lock register for page 15.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK15_OFFSET, 0x0000003c
.equ	OTP_SW_LOCK15_BITS, 0x0000000f
.equ	OTP_SW_LOCK15_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK15_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK15_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK15_NSEC_MSB, 3
.equ	OTP_SW_LOCK15_NSEC_LSB, 2
.equ	OTP_SW_LOCK15_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK15_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK15_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK15_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK15_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK15_SEC_MSB, 1
.equ	OTP_SW_LOCK15_SEC_LSB, 0
.equ	OTP_SW_LOCK15_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK15_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK15_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK16
# Description : Software lock register for page 16.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK16_OFFSET, 0x00000040
.equ	OTP_SW_LOCK16_BITS, 0x0000000f
.equ	OTP_SW_LOCK16_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK16_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK16_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK16_NSEC_MSB, 3
.equ	OTP_SW_LOCK16_NSEC_LSB, 2
.equ	OTP_SW_LOCK16_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK16_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK16_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK16_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK16_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK16_SEC_MSB, 1
.equ	OTP_SW_LOCK16_SEC_LSB, 0
.equ	OTP_SW_LOCK16_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK16_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK16_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK17
# Description : Software lock register for page 17.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK17_OFFSET, 0x00000044
.equ	OTP_SW_LOCK17_BITS, 0x0000000f
.equ	OTP_SW_LOCK17_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK17_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK17_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK17_NSEC_MSB, 3
.equ	OTP_SW_LOCK17_NSEC_LSB, 2
.equ	OTP_SW_LOCK17_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK17_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK17_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK17_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK17_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK17_SEC_MSB, 1
.equ	OTP_SW_LOCK17_SEC_LSB, 0
.equ	OTP_SW_LOCK17_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK17_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK17_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK18
# Description : Software lock register for page 18.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK18_OFFSET, 0x00000048
.equ	OTP_SW_LOCK18_BITS, 0x0000000f
.equ	OTP_SW_LOCK18_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK18_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK18_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK18_NSEC_MSB, 3
.equ	OTP_SW_LOCK18_NSEC_LSB, 2
.equ	OTP_SW_LOCK18_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK18_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK18_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK18_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK18_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK18_SEC_MSB, 1
.equ	OTP_SW_LOCK18_SEC_LSB, 0
.equ	OTP_SW_LOCK18_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK18_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK18_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK19
# Description : Software lock register for page 19.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK19_OFFSET, 0x0000004c
.equ	OTP_SW_LOCK19_BITS, 0x0000000f
.equ	OTP_SW_LOCK19_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK19_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK19_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK19_NSEC_MSB, 3
.equ	OTP_SW_LOCK19_NSEC_LSB, 2
.equ	OTP_SW_LOCK19_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK19_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK19_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK19_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK19_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK19_SEC_MSB, 1
.equ	OTP_SW_LOCK19_SEC_LSB, 0
.equ	OTP_SW_LOCK19_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK19_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK19_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK20
# Description : Software lock register for page 20.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK20_OFFSET, 0x00000050
.equ	OTP_SW_LOCK20_BITS, 0x0000000f
.equ	OTP_SW_LOCK20_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK20_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK20_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK20_NSEC_MSB, 3
.equ	OTP_SW_LOCK20_NSEC_LSB, 2
.equ	OTP_SW_LOCK20_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK20_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK20_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK20_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK20_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK20_SEC_MSB, 1
.equ	OTP_SW_LOCK20_SEC_LSB, 0
.equ	OTP_SW_LOCK20_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK20_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK20_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK21
# Description : Software lock register for page 21.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK21_OFFSET, 0x00000054
.equ	OTP_SW_LOCK21_BITS, 0x0000000f
.equ	OTP_SW_LOCK21_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK21_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK21_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK21_NSEC_MSB, 3
.equ	OTP_SW_LOCK21_NSEC_LSB, 2
.equ	OTP_SW_LOCK21_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK21_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK21_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK21_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK21_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK21_SEC_MSB, 1
.equ	OTP_SW_LOCK21_SEC_LSB, 0
.equ	OTP_SW_LOCK21_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK21_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK21_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK22
# Description : Software lock register for page 22.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK22_OFFSET, 0x00000058
.equ	OTP_SW_LOCK22_BITS, 0x0000000f
.equ	OTP_SW_LOCK22_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK22_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK22_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK22_NSEC_MSB, 3
.equ	OTP_SW_LOCK22_NSEC_LSB, 2
.equ	OTP_SW_LOCK22_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK22_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK22_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK22_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK22_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK22_SEC_MSB, 1
.equ	OTP_SW_LOCK22_SEC_LSB, 0
.equ	OTP_SW_LOCK22_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK22_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK22_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK23
# Description : Software lock register for page 23.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK23_OFFSET, 0x0000005c
.equ	OTP_SW_LOCK23_BITS, 0x0000000f
.equ	OTP_SW_LOCK23_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK23_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK23_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK23_NSEC_MSB, 3
.equ	OTP_SW_LOCK23_NSEC_LSB, 2
.equ	OTP_SW_LOCK23_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK23_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK23_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK23_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK23_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK23_SEC_MSB, 1
.equ	OTP_SW_LOCK23_SEC_LSB, 0
.equ	OTP_SW_LOCK23_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK23_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK23_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK24
# Description : Software lock register for page 24.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK24_OFFSET, 0x00000060
.equ	OTP_SW_LOCK24_BITS, 0x0000000f
.equ	OTP_SW_LOCK24_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK24_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK24_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK24_NSEC_MSB, 3
.equ	OTP_SW_LOCK24_NSEC_LSB, 2
.equ	OTP_SW_LOCK24_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK24_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK24_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK24_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK24_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK24_SEC_MSB, 1
.equ	OTP_SW_LOCK24_SEC_LSB, 0
.equ	OTP_SW_LOCK24_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK24_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK24_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK25
# Description : Software lock register for page 25.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK25_OFFSET, 0x00000064
.equ	OTP_SW_LOCK25_BITS, 0x0000000f
.equ	OTP_SW_LOCK25_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK25_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK25_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK25_NSEC_MSB, 3
.equ	OTP_SW_LOCK25_NSEC_LSB, 2
.equ	OTP_SW_LOCK25_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK25_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK25_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK25_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK25_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK25_SEC_MSB, 1
.equ	OTP_SW_LOCK25_SEC_LSB, 0
.equ	OTP_SW_LOCK25_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK25_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK25_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK26
# Description : Software lock register for page 26.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK26_OFFSET, 0x00000068
.equ	OTP_SW_LOCK26_BITS, 0x0000000f
.equ	OTP_SW_LOCK26_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK26_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK26_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK26_NSEC_MSB, 3
.equ	OTP_SW_LOCK26_NSEC_LSB, 2
.equ	OTP_SW_LOCK26_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK26_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK26_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK26_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK26_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK26_SEC_MSB, 1
.equ	OTP_SW_LOCK26_SEC_LSB, 0
.equ	OTP_SW_LOCK26_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK26_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK26_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK27
# Description : Software lock register for page 27.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK27_OFFSET, 0x0000006c
.equ	OTP_SW_LOCK27_BITS, 0x0000000f
.equ	OTP_SW_LOCK27_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK27_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK27_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK27_NSEC_MSB, 3
.equ	OTP_SW_LOCK27_NSEC_LSB, 2
.equ	OTP_SW_LOCK27_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK27_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK27_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK27_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK27_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK27_SEC_MSB, 1
.equ	OTP_SW_LOCK27_SEC_LSB, 0
.equ	OTP_SW_LOCK27_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK27_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK27_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK28
# Description : Software lock register for page 28.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK28_OFFSET, 0x00000070
.equ	OTP_SW_LOCK28_BITS, 0x0000000f
.equ	OTP_SW_LOCK28_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK28_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
