konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/otp.inc
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK28_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK28_NSEC_MSB, 3
.equ	OTP_SW_LOCK28_NSEC_LSB, 2
.equ	OTP_SW_LOCK28_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK28_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK28_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK28_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK28_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK28_SEC_MSB, 1
.equ	OTP_SW_LOCK28_SEC_LSB, 0
.equ	OTP_SW_LOCK28_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK28_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK28_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK29
# Description : Software lock register for page 29.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK29_OFFSET, 0x00000074
.equ	OTP_SW_LOCK29_BITS, 0x0000000f
.equ	OTP_SW_LOCK29_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK29_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK29_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK29_NSEC_MSB, 3
.equ	OTP_SW_LOCK29_NSEC_LSB, 2
.equ	OTP_SW_LOCK29_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK29_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK29_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK29_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK29_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK29_SEC_MSB, 1
.equ	OTP_SW_LOCK29_SEC_LSB, 0
.equ	OTP_SW_LOCK29_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK29_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK29_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK30
# Description : Software lock register for page 30.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK30_OFFSET, 0x00000078
.equ	OTP_SW_LOCK30_BITS, 0x0000000f
.equ	OTP_SW_LOCK30_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK30_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK30_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK30_NSEC_MSB, 3
.equ	OTP_SW_LOCK30_NSEC_LSB, 2
.equ	OTP_SW_LOCK30_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK30_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK30_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK30_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK30_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK30_SEC_MSB, 1
.equ	OTP_SW_LOCK30_SEC_LSB, 0
.equ	OTP_SW_LOCK30_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK30_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK30_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK31
# Description : Software lock register for page 31.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK31_OFFSET, 0x0000007c
.equ	OTP_SW_LOCK31_BITS, 0x0000000f
.equ	OTP_SW_LOCK31_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK31_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK31_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK31_NSEC_MSB, 3
.equ	OTP_SW_LOCK31_NSEC_LSB, 2
.equ	OTP_SW_LOCK31_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK31_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK31_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK31_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK31_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK31_SEC_MSB, 1
.equ	OTP_SW_LOCK31_SEC_LSB, 0
.equ	OTP_SW_LOCK31_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK31_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK31_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK32
# Description : Software lock register for page 32.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK32_OFFSET, 0x00000080
.equ	OTP_SW_LOCK32_BITS, 0x0000000f
.equ	OTP_SW_LOCK32_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK32_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK32_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK32_NSEC_MSB, 3
.equ	OTP_SW_LOCK32_NSEC_LSB, 2
.equ	OTP_SW_LOCK32_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK32_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK32_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK32_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK32_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK32_SEC_MSB, 1
.equ	OTP_SW_LOCK32_SEC_LSB, 0
.equ	OTP_SW_LOCK32_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK32_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK32_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK33
# Description : Software lock register for page 33.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK33_OFFSET, 0x00000084
.equ	OTP_SW_LOCK33_BITS, 0x0000000f
.equ	OTP_SW_LOCK33_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK33_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK33_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK33_NSEC_MSB, 3
.equ	OTP_SW_LOCK33_NSEC_LSB, 2
.equ	OTP_SW_LOCK33_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK33_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK33_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK33_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK33_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK33_SEC_MSB, 1
.equ	OTP_SW_LOCK33_SEC_LSB, 0
.equ	OTP_SW_LOCK33_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK33_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK33_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK34
# Description : Software lock register for page 34.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK34_OFFSET, 0x00000088
.equ	OTP_SW_LOCK34_BITS, 0x0000000f
.equ	OTP_SW_LOCK34_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK34_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK34_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK34_NSEC_MSB, 3
.equ	OTP_SW_LOCK34_NSEC_LSB, 2
.equ	OTP_SW_LOCK34_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK34_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK34_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK34_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK34_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK34_SEC_MSB, 1
.equ	OTP_SW_LOCK34_SEC_LSB, 0
.equ	OTP_SW_LOCK34_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK34_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK34_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK35
# Description : Software lock register for page 35.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK35_OFFSET, 0x0000008c
.equ	OTP_SW_LOCK35_BITS, 0x0000000f
.equ	OTP_SW_LOCK35_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK35_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK35_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK35_NSEC_MSB, 3
.equ	OTP_SW_LOCK35_NSEC_LSB, 2
.equ	OTP_SW_LOCK35_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK35_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK35_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK35_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK35_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK35_SEC_MSB, 1
.equ	OTP_SW_LOCK35_SEC_LSB, 0
.equ	OTP_SW_LOCK35_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK35_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK35_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK36
# Description : Software lock register for page 36.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK36_OFFSET, 0x00000090
.equ	OTP_SW_LOCK36_BITS, 0x0000000f
.equ	OTP_SW_LOCK36_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK36_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK36_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK36_NSEC_MSB, 3
.equ	OTP_SW_LOCK36_NSEC_LSB, 2
.equ	OTP_SW_LOCK36_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK36_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK36_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK36_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK36_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK36_SEC_MSB, 1
.equ	OTP_SW_LOCK36_SEC_LSB, 0
.equ	OTP_SW_LOCK36_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK36_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK36_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK37
# Description : Software lock register for page 37.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK37_OFFSET, 0x00000094
.equ	OTP_SW_LOCK37_BITS, 0x0000000f
.equ	OTP_SW_LOCK37_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK37_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK37_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK37_NSEC_MSB, 3
.equ	OTP_SW_LOCK37_NSEC_LSB, 2
.equ	OTP_SW_LOCK37_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK37_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK37_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK37_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK37_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK37_SEC_MSB, 1
.equ	OTP_SW_LOCK37_SEC_LSB, 0
.equ	OTP_SW_LOCK37_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK37_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK37_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK38
# Description : Software lock register for page 38.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK38_OFFSET, 0x00000098
.equ	OTP_SW_LOCK38_BITS, 0x0000000f
.equ	OTP_SW_LOCK38_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK38_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK38_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK38_NSEC_MSB, 3
.equ	OTP_SW_LOCK38_NSEC_LSB, 2
.equ	OTP_SW_LOCK38_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK38_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK38_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK38_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK38_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK38_SEC_MSB, 1
.equ	OTP_SW_LOCK38_SEC_LSB, 0
.equ	OTP_SW_LOCK38_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK38_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK38_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK39
# Description : Software lock register for page 39.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK39_OFFSET, 0x0000009c
.equ	OTP_SW_LOCK39_BITS, 0x0000000f
.equ	OTP_SW_LOCK39_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK39_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK39_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK39_NSEC_MSB, 3
.equ	OTP_SW_LOCK39_NSEC_LSB, 2
.equ	OTP_SW_LOCK39_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK39_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK39_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK39_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK39_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK39_SEC_MSB, 1
.equ	OTP_SW_LOCK39_SEC_LSB, 0
.equ	OTP_SW_LOCK39_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK39_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK39_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK40
# Description : Software lock register for page 40.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK40_OFFSET, 0x000000a0
.equ	OTP_SW_LOCK40_BITS, 0x0000000f
.equ	OTP_SW_LOCK40_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK40_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK40_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK40_NSEC_MSB, 3
.equ	OTP_SW_LOCK40_NSEC_LSB, 2
.equ	OTP_SW_LOCK40_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK40_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK40_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK40_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK40_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK40_SEC_MSB, 1
.equ	OTP_SW_LOCK40_SEC_LSB, 0
.equ	OTP_SW_LOCK40_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK40_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK40_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK41
# Description : Software lock register for page 41.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK41_OFFSET, 0x000000a4
.equ	OTP_SW_LOCK41_BITS, 0x0000000f
.equ	OTP_SW_LOCK41_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK41_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK41_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK41_NSEC_MSB, 3
.equ	OTP_SW_LOCK41_NSEC_LSB, 2
.equ	OTP_SW_LOCK41_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK41_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK41_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK41_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK41_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK41_SEC_MSB, 1
.equ	OTP_SW_LOCK41_SEC_LSB, 0
.equ	OTP_SW_LOCK41_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK41_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK41_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK42
# Description : Software lock register for page 42.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK42_OFFSET, 0x000000a8
.equ	OTP_SW_LOCK42_BITS, 0x0000000f
.equ	OTP_SW_LOCK42_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK42_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK42_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK42_NSEC_MSB, 3
.equ	OTP_SW_LOCK42_NSEC_LSB, 2
.equ	OTP_SW_LOCK42_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK42_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK42_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK42_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
