konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/otp.inc
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK42_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK42_SEC_MSB, 1
.equ	OTP_SW_LOCK42_SEC_LSB, 0
.equ	OTP_SW_LOCK42_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK42_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK42_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK43
# Description : Software lock register for page 43.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK43_OFFSET, 0x000000ac
.equ	OTP_SW_LOCK43_BITS, 0x0000000f
.equ	OTP_SW_LOCK43_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK43_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK43_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK43_NSEC_MSB, 3
.equ	OTP_SW_LOCK43_NSEC_LSB, 2
.equ	OTP_SW_LOCK43_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK43_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK43_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK43_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK43_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK43_SEC_MSB, 1
.equ	OTP_SW_LOCK43_SEC_LSB, 0
.equ	OTP_SW_LOCK43_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK43_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK43_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK44
# Description : Software lock register for page 44.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK44_OFFSET, 0x000000b0
.equ	OTP_SW_LOCK44_BITS, 0x0000000f
.equ	OTP_SW_LOCK44_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK44_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK44_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK44_NSEC_MSB, 3
.equ	OTP_SW_LOCK44_NSEC_LSB, 2
.equ	OTP_SW_LOCK44_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK44_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK44_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK44_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK44_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK44_SEC_MSB, 1
.equ	OTP_SW_LOCK44_SEC_LSB, 0
.equ	OTP_SW_LOCK44_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK44_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK44_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK45
# Description : Software lock register for page 45.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK45_OFFSET, 0x000000b4
.equ	OTP_SW_LOCK45_BITS, 0x0000000f
.equ	OTP_SW_LOCK45_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK45_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK45_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK45_NSEC_MSB, 3
.equ	OTP_SW_LOCK45_NSEC_LSB, 2
.equ	OTP_SW_LOCK45_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK45_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK45_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK45_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK45_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK45_SEC_MSB, 1
.equ	OTP_SW_LOCK45_SEC_LSB, 0
.equ	OTP_SW_LOCK45_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK45_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK45_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK46
# Description : Software lock register for page 46.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK46_OFFSET, 0x000000b8
.equ	OTP_SW_LOCK46_BITS, 0x0000000f
.equ	OTP_SW_LOCK46_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK46_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK46_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK46_NSEC_MSB, 3
.equ	OTP_SW_LOCK46_NSEC_LSB, 2
.equ	OTP_SW_LOCK46_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK46_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK46_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK46_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK46_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK46_SEC_MSB, 1
.equ	OTP_SW_LOCK46_SEC_LSB, 0
.equ	OTP_SW_LOCK46_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK46_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK46_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK47
# Description : Software lock register for page 47.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK47_OFFSET, 0x000000bc
.equ	OTP_SW_LOCK47_BITS, 0x0000000f
.equ	OTP_SW_LOCK47_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK47_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK47_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK47_NSEC_MSB, 3
.equ	OTP_SW_LOCK47_NSEC_LSB, 2
.equ	OTP_SW_LOCK47_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK47_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK47_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK47_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK47_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK47_SEC_MSB, 1
.equ	OTP_SW_LOCK47_SEC_LSB, 0
.equ	OTP_SW_LOCK47_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK47_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK47_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK48
# Description : Software lock register for page 48.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK48_OFFSET, 0x000000c0
.equ	OTP_SW_LOCK48_BITS, 0x0000000f
.equ	OTP_SW_LOCK48_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK48_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK48_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK48_NSEC_MSB, 3
.equ	OTP_SW_LOCK48_NSEC_LSB, 2
.equ	OTP_SW_LOCK48_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK48_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK48_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK48_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK48_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK48_SEC_MSB, 1
.equ	OTP_SW_LOCK48_SEC_LSB, 0
.equ	OTP_SW_LOCK48_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK48_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK48_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK49
# Description : Software lock register for page 49.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK49_OFFSET, 0x000000c4
.equ	OTP_SW_LOCK49_BITS, 0x0000000f
.equ	OTP_SW_LOCK49_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK49_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK49_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK49_NSEC_MSB, 3
.equ	OTP_SW_LOCK49_NSEC_LSB, 2
.equ	OTP_SW_LOCK49_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK49_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK49_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK49_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK49_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK49_SEC_MSB, 1
.equ	OTP_SW_LOCK49_SEC_LSB, 0
.equ	OTP_SW_LOCK49_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK49_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK49_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK50
# Description : Software lock register for page 50.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK50_OFFSET, 0x000000c8
.equ	OTP_SW_LOCK50_BITS, 0x0000000f
.equ	OTP_SW_LOCK50_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK50_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK50_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK50_NSEC_MSB, 3
.equ	OTP_SW_LOCK50_NSEC_LSB, 2
.equ	OTP_SW_LOCK50_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK50_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK50_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK50_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK50_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK50_SEC_MSB, 1
.equ	OTP_SW_LOCK50_SEC_LSB, 0
.equ	OTP_SW_LOCK50_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK50_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK50_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK51
# Description : Software lock register for page 51.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK51_OFFSET, 0x000000cc
.equ	OTP_SW_LOCK51_BITS, 0x0000000f
.equ	OTP_SW_LOCK51_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK51_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK51_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK51_NSEC_MSB, 3
.equ	OTP_SW_LOCK51_NSEC_LSB, 2
.equ	OTP_SW_LOCK51_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK51_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK51_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK51_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK51_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK51_SEC_MSB, 1
.equ	OTP_SW_LOCK51_SEC_LSB, 0
.equ	OTP_SW_LOCK51_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK51_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK51_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK52
# Description : Software lock register for page 52.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK52_OFFSET, 0x000000d0
.equ	OTP_SW_LOCK52_BITS, 0x0000000f
.equ	OTP_SW_LOCK52_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK52_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK52_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK52_NSEC_MSB, 3
.equ	OTP_SW_LOCK52_NSEC_LSB, 2
.equ	OTP_SW_LOCK52_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK52_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK52_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK52_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK52_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK52_SEC_MSB, 1
.equ	OTP_SW_LOCK52_SEC_LSB, 0
.equ	OTP_SW_LOCK52_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK52_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK52_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK53
# Description : Software lock register for page 53.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK53_OFFSET, 0x000000d4
.equ	OTP_SW_LOCK53_BITS, 0x0000000f
.equ	OTP_SW_LOCK53_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK53_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK53_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK53_NSEC_MSB, 3
.equ	OTP_SW_LOCK53_NSEC_LSB, 2
.equ	OTP_SW_LOCK53_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK53_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK53_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK53_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK53_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK53_SEC_MSB, 1
.equ	OTP_SW_LOCK53_SEC_LSB, 0
.equ	OTP_SW_LOCK53_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK53_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK53_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK54
# Description : Software lock register for page 54.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK54_OFFSET, 0x000000d8
.equ	OTP_SW_LOCK54_BITS, 0x0000000f
.equ	OTP_SW_LOCK54_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK54_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK54_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK54_NSEC_MSB, 3
.equ	OTP_SW_LOCK54_NSEC_LSB, 2
.equ	OTP_SW_LOCK54_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK54_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK54_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK54_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK54_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK54_SEC_MSB, 1
.equ	OTP_SW_LOCK54_SEC_LSB, 0
.equ	OTP_SW_LOCK54_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK54_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK54_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK55
# Description : Software lock register for page 55.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK55_OFFSET, 0x000000dc
.equ	OTP_SW_LOCK55_BITS, 0x0000000f
.equ	OTP_SW_LOCK55_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK55_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK55_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK55_NSEC_MSB, 3
.equ	OTP_SW_LOCK55_NSEC_LSB, 2
.equ	OTP_SW_LOCK55_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK55_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK55_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK55_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK55_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK55_SEC_MSB, 1
.equ	OTP_SW_LOCK55_SEC_LSB, 0
.equ	OTP_SW_LOCK55_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK55_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK55_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK56
# Description : Software lock register for page 56.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK56_OFFSET, 0x000000e0
.equ	OTP_SW_LOCK56_BITS, 0x0000000f
.equ	OTP_SW_LOCK56_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK56_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK56_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK56_NSEC_MSB, 3
.equ	OTP_SW_LOCK56_NSEC_LSB, 2
.equ	OTP_SW_LOCK56_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK56_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK56_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK56_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK56_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK56_SEC_MSB, 1
.equ	OTP_SW_LOCK56_SEC_LSB, 0
.equ	OTP_SW_LOCK56_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK56_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK56_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK57
# Description : Software lock register for page 57.
#
