konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/otp.inc
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK57_OFFSET, 0x000000e4
.equ	OTP_SW_LOCK57_BITS, 0x0000000f
.equ	OTP_SW_LOCK57_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK57_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK57_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK57_NSEC_MSB, 3
.equ	OTP_SW_LOCK57_NSEC_LSB, 2
.equ	OTP_SW_LOCK57_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK57_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK57_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK57_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK57_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK57_SEC_MSB, 1
.equ	OTP_SW_LOCK57_SEC_LSB, 0
.equ	OTP_SW_LOCK57_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK57_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK57_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK58
# Description : Software lock register for page 58.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK58_OFFSET, 0x000000e8
.equ	OTP_SW_LOCK58_BITS, 0x0000000f
.equ	OTP_SW_LOCK58_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK58_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK58_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK58_NSEC_MSB, 3
.equ	OTP_SW_LOCK58_NSEC_LSB, 2
.equ	OTP_SW_LOCK58_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK58_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK58_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK58_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK58_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK58_SEC_MSB, 1
.equ	OTP_SW_LOCK58_SEC_LSB, 0
.equ	OTP_SW_LOCK58_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK58_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK58_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK59
# Description : Software lock register for page 59.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK59_OFFSET, 0x000000ec
.equ	OTP_SW_LOCK59_BITS, 0x0000000f
.equ	OTP_SW_LOCK59_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK59_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK59_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK59_NSEC_MSB, 3
.equ	OTP_SW_LOCK59_NSEC_LSB, 2
.equ	OTP_SW_LOCK59_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK59_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK59_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK59_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK59_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK59_SEC_MSB, 1
.equ	OTP_SW_LOCK59_SEC_LSB, 0
.equ	OTP_SW_LOCK59_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK59_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK59_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK60
# Description : Software lock register for page 60.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK60_OFFSET, 0x000000f0
.equ	OTP_SW_LOCK60_BITS, 0x0000000f
.equ	OTP_SW_LOCK60_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK60_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK60_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK60_NSEC_MSB, 3
.equ	OTP_SW_LOCK60_NSEC_LSB, 2
.equ	OTP_SW_LOCK60_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK60_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK60_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK60_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK60_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK60_SEC_MSB, 1
.equ	OTP_SW_LOCK60_SEC_LSB, 0
.equ	OTP_SW_LOCK60_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK60_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK60_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK61
# Description : Software lock register for page 61.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK61_OFFSET, 0x000000f4
.equ	OTP_SW_LOCK61_BITS, 0x0000000f
.equ	OTP_SW_LOCK61_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK61_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK61_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK61_NSEC_MSB, 3
.equ	OTP_SW_LOCK61_NSEC_LSB, 2
.equ	OTP_SW_LOCK61_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK61_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK61_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK61_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK61_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK61_SEC_MSB, 1
.equ	OTP_SW_LOCK61_SEC_LSB, 0
.equ	OTP_SW_LOCK61_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK61_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK61_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK62
# Description : Software lock register for page 62.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK62_OFFSET, 0x000000f8
.equ	OTP_SW_LOCK62_BITS, 0x0000000f
.equ	OTP_SW_LOCK62_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK62_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK62_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK62_NSEC_MSB, 3
.equ	OTP_SW_LOCK62_NSEC_LSB, 2
.equ	OTP_SW_LOCK62_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK62_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK62_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK62_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK62_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK62_SEC_MSB, 1
.equ	OTP_SW_LOCK62_SEC_LSB, 0
.equ	OTP_SW_LOCK62_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK62_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK62_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SW_LOCK63
# Description : Software lock register for page 63.
#
#               Locks are initialised from the OTP lock pages at reset. This
#               register can be written to further advance the lock state of
#               each page (until next reset), and read to check the current
#               lock state of a page.
.equ	OTP_SW_LOCK63_OFFSET, 0x000000fc
.equ	OTP_SW_LOCK63_BITS, 0x0000000f
.equ	OTP_SW_LOCK63_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK63_NSEC
# Description : Non-secure lock status. Writes are OR'd with the current value.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK63_NSEC_BITS, 0x0000000c
.equ	OTP_SW_LOCK63_NSEC_MSB, 3
.equ	OTP_SW_LOCK63_NSEC_LSB, 2
.equ	OTP_SW_LOCK63_NSEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK63_NSEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK63_NSEC_VALUE_INACCESSIBLE, 0x3
# -----------------------------------------------------------------------------
# Field       : OTP_SW_LOCK63_SEC
# Description : Secure lock status. Writes are OR'd with the current value.
#               This field is read-only to Non-secure code.
#               0x0 -> read_write
#               0x1 -> read_only
#               0x3 -> inaccessible
.equ	OTP_SW_LOCK63_SEC_BITS, 0x00000003
.equ	OTP_SW_LOCK63_SEC_MSB, 1
.equ	OTP_SW_LOCK63_SEC_LSB, 0
.equ	OTP_SW_LOCK63_SEC_VALUE_READ_WRITE, 0x0
.equ	OTP_SW_LOCK63_SEC_VALUE_READ_ONLY, 0x1
.equ	OTP_SW_LOCK63_SEC_VALUE_INACCESSIBLE, 0x3
# =============================================================================
# Register    : OTP_SBPI_INSTR
# Description : Dispatch instructions to the SBPI interface, used for
#               programming the OTP fuses.
.equ	OTP_SBPI_INSTR_OFFSET, 0x00000100
.equ	OTP_SBPI_INSTR_BITS, 0x7fffffff
.equ	OTP_SBPI_INSTR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SBPI_INSTR_EXEC
# Description : Execute instruction
.equ	OTP_SBPI_INSTR_EXEC_RESET, 0x0
.equ	OTP_SBPI_INSTR_EXEC_BITS, 0x40000000
.equ	OTP_SBPI_INSTR_EXEC_MSB, 30
.equ	OTP_SBPI_INSTR_EXEC_LSB, 30
# -----------------------------------------------------------------------------
# Field       : OTP_SBPI_INSTR_IS_WR
# Description : Payload type is write
.equ	OTP_SBPI_INSTR_IS_WR_RESET, 0x0
.equ	OTP_SBPI_INSTR_IS_WR_BITS, 0x20000000
.equ	OTP_SBPI_INSTR_IS_WR_MSB, 29
.equ	OTP_SBPI_INSTR_IS_WR_LSB, 29
# -----------------------------------------------------------------------------
# Field       : OTP_SBPI_INSTR_HAS_PAYLOAD
# Description : Instruction has payload (data to be written or to be read)
.equ	OTP_SBPI_INSTR_HAS_PAYLOAD_RESET, 0x0
.equ	OTP_SBPI_INSTR_HAS_PAYLOAD_BITS, 0x10000000
.equ	OTP_SBPI_INSTR_HAS_PAYLOAD_MSB, 28
.equ	OTP_SBPI_INSTR_HAS_PAYLOAD_LSB, 28
# -----------------------------------------------------------------------------
# Field       : OTP_SBPI_INSTR_PAYLOAD_SIZE_M1
# Description : Instruction payload size in bytes minus 1
.equ	OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_RESET, 0x0
.equ	OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_BITS, 0x0f000000
.equ	OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_MSB, 27
.equ	OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_LSB, 24
# -----------------------------------------------------------------------------
# Field       : OTP_SBPI_INSTR_TARGET
# Description : Instruction target, it can be PMC (0x3a) or DAP (0x02)
.equ	OTP_SBPI_INSTR_TARGET_RESET, 0x00
.equ	OTP_SBPI_INSTR_TARGET_BITS, 0x00ff0000
.equ	OTP_SBPI_INSTR_TARGET_MSB, 23
.equ	OTP_SBPI_INSTR_TARGET_LSB, 16
# -----------------------------------------------------------------------------
# Field       : OTP_SBPI_INSTR_CMD
.equ	OTP_SBPI_INSTR_CMD_RESET, 0x00
.equ	OTP_SBPI_INSTR_CMD_BITS, 0x0000ff00
.equ	OTP_SBPI_INSTR_CMD_MSB, 15
.equ	OTP_SBPI_INSTR_CMD_LSB, 8
# -----------------------------------------------------------------------------
# Field       : OTP_SBPI_INSTR_SHORT_WDATA
# Description : wdata to be used only when payload_size_m1=0
.equ	OTP_SBPI_INSTR_SHORT_WDATA_RESET, 0x00
.equ	OTP_SBPI_INSTR_SHORT_WDATA_BITS, 0x000000ff
.equ	OTP_SBPI_INSTR_SHORT_WDATA_MSB, 7
.equ	OTP_SBPI_INSTR_SHORT_WDATA_LSB, 0
# =============================================================================
# Register    : OTP_SBPI_WDATA_0
# Description : SBPI write payload bytes 3..0
.equ	OTP_SBPI_WDATA_0_OFFSET, 0x00000104
.equ	OTP_SBPI_WDATA_0_BITS, 0xffffffff
.equ	OTP_SBPI_WDATA_0_RESET, 0x00000000
.equ	OTP_SBPI_WDATA_0_MSB, 31
.equ	OTP_SBPI_WDATA_0_LSB, 0
# =============================================================================
# Register    : OTP_SBPI_WDATA_1
# Description : SBPI write payload bytes 7..4
.equ	OTP_SBPI_WDATA_1_OFFSET, 0x00000108
.equ	OTP_SBPI_WDATA_1_BITS, 0xffffffff
.equ	OTP_SBPI_WDATA_1_RESET, 0x00000000
.equ	OTP_SBPI_WDATA_1_MSB, 31
.equ	OTP_SBPI_WDATA_1_LSB, 0
# =============================================================================
# Register    : OTP_SBPI_WDATA_2
# Description : SBPI write payload bytes 11..8
.equ	OTP_SBPI_WDATA_2_OFFSET, 0x0000010c
.equ	OTP_SBPI_WDATA_2_BITS, 0xffffffff
.equ	OTP_SBPI_WDATA_2_RESET, 0x00000000
.equ	OTP_SBPI_WDATA_2_MSB, 31
.equ	OTP_SBPI_WDATA_2_LSB, 0
# =============================================================================
# Register    : OTP_SBPI_WDATA_3
# Description : SBPI write payload bytes 15..12
.equ	OTP_SBPI_WDATA_3_OFFSET, 0x00000110
.equ	OTP_SBPI_WDATA_3_BITS, 0xffffffff
.equ	OTP_SBPI_WDATA_3_RESET, 0x00000000
.equ	OTP_SBPI_WDATA_3_MSB, 31
.equ	OTP_SBPI_WDATA_3_LSB, 0
# =============================================================================
# Register    : OTP_SBPI_RDATA_0
# Description : Read payload bytes 3..0. Once read, the data in the register
#               will automatically clear to 0.
.equ	OTP_SBPI_RDATA_0_OFFSET, 0x00000114
.equ	OTP_SBPI_RDATA_0_BITS, 0xffffffff
.equ	OTP_SBPI_RDATA_0_RESET, 0x00000000
.equ	OTP_SBPI_RDATA_0_MSB, 31
.equ	OTP_SBPI_RDATA_0_LSB, 0
# =============================================================================
# Register    : OTP_SBPI_RDATA_1
# Description : Read payload bytes 7..4. Once read, the data in the register
#               will automatically clear to 0.
.equ	OTP_SBPI_RDATA_1_OFFSET, 0x00000118
.equ	OTP_SBPI_RDATA_1_BITS, 0xffffffff
.equ	OTP_SBPI_RDATA_1_RESET, 0x00000000
.equ	OTP_SBPI_RDATA_1_MSB, 31
.equ	OTP_SBPI_RDATA_1_LSB, 0
# =============================================================================
# Register    : OTP_SBPI_RDATA_2
# Description : Read payload bytes 11..8. Once read, the data in the register
#               will automatically clear to 0.
.equ	OTP_SBPI_RDATA_2_OFFSET, 0x0000011c
.equ	OTP_SBPI_RDATA_2_BITS, 0xffffffff
.equ	OTP_SBPI_RDATA_2_RESET, 0x00000000
.equ	OTP_SBPI_RDATA_2_MSB, 31
.equ	OTP_SBPI_RDATA_2_LSB, 0
# =============================================================================
# Register    : OTP_SBPI_RDATA_3
# Description : Read payload bytes 15..12. Once read, the data in the register
#               will automatically clear to 0.
.equ	OTP_SBPI_RDATA_3_OFFSET, 0x00000120
.equ	OTP_SBPI_RDATA_3_BITS, 0xffffffff
.equ	OTP_SBPI_RDATA_3_RESET, 0x00000000
.equ	OTP_SBPI_RDATA_3_MSB, 31
.equ	OTP_SBPI_RDATA_3_LSB, 0
# =============================================================================
# Register    : OTP_SBPI_STATUS
.equ	OTP_SBPI_STATUS_OFFSET, 0x00000124
.equ	OTP_SBPI_STATUS_BITS, 0x00ff1111
.equ	OTP_SBPI_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_SBPI_STATUS_MISO
# Description : SBPI MISO (master in - slave out): response from SBPI
.equ	OTP_SBPI_STATUS_MISO_BITS, 0x00ff0000
.equ	OTP_SBPI_STATUS_MISO_MSB, 23
.equ	OTP_SBPI_STATUS_MISO_LSB, 16
# -----------------------------------------------------------------------------
# Field       : OTP_SBPI_STATUS_FLAG
# Description : SBPI flag
.equ	OTP_SBPI_STATUS_FLAG_BITS, 0x00001000
.equ	OTP_SBPI_STATUS_FLAG_MSB, 12
.equ	OTP_SBPI_STATUS_FLAG_LSB, 12
# -----------------------------------------------------------------------------
# Field       : OTP_SBPI_STATUS_INSTR_MISS
# Description : Last instruction missed (dropped), as the previous has not
#               finished running
.equ	OTP_SBPI_STATUS_INSTR_MISS_RESET, 0x0
.equ	OTP_SBPI_STATUS_INSTR_MISS_BITS, 0x00000100
.equ	OTP_SBPI_STATUS_INSTR_MISS_MSB, 8
.equ	OTP_SBPI_STATUS_INSTR_MISS_LSB, 8
# -----------------------------------------------------------------------------
# Field       : OTP_SBPI_STATUS_INSTR_DONE
# Description : Last instruction done
.equ	OTP_SBPI_STATUS_INSTR_DONE_RESET, 0x0
.equ	OTP_SBPI_STATUS_INSTR_DONE_BITS, 0x00000010
.equ	OTP_SBPI_STATUS_INSTR_DONE_MSB, 4
.equ	OTP_SBPI_STATUS_INSTR_DONE_LSB, 4
# -----------------------------------------------------------------------------
# Field       : OTP_SBPI_STATUS_RDATA_VLD
# Description : Read command has returned data
.equ	OTP_SBPI_STATUS_RDATA_VLD_RESET, 0x0
.equ	OTP_SBPI_STATUS_RDATA_VLD_BITS, 0x00000001
.equ	OTP_SBPI_STATUS_RDATA_VLD_MSB, 0
.equ	OTP_SBPI_STATUS_RDATA_VLD_LSB, 0
# =============================================================================
# Register    : OTP_USR
# Description : Controls for APB data read interface (USER interface)
.equ	OTP_USR_OFFSET, 0x00000128
.equ	OTP_USR_BITS, 0x00000011
.equ	OTP_USR_RESET, 0x00000001
# -----------------------------------------------------------------------------
# Field       : OTP_USR_PD
# Description : Power-down; 1 disables current reference. Must be 0 to read
#               data from the OTP.
.equ	OTP_USR_PD_RESET, 0x0
.equ	OTP_USR_PD_BITS, 0x00000010
.equ	OTP_USR_PD_MSB, 4
.equ	OTP_USR_PD_LSB, 4
# -----------------------------------------------------------------------------
# Field       : OTP_USR_DCTRL
# Description : 1 enables USER interface; 0 disables USER interface (enables
#               SBPI).
#
#               This bit must be cleared before performing any SBPI access,
#               such as when programming the OTP. The APB data read interface
#               (USER interface) will be inaccessible during this time, and
#               will return a bus error if any read is attempted.
.equ	OTP_USR_DCTRL_RESET, 0x1
.equ	OTP_USR_DCTRL_BITS, 0x00000001
.equ	OTP_USR_DCTRL_MSB, 0
.equ	OTP_USR_DCTRL_LSB, 0
# =============================================================================
# Register    : OTP_DBG
# Description : Debug for OTP power-on state machine
.equ	OTP_DBG_OFFSET, 0x0000012c
.equ	OTP_DBG_BITS, 0x000010ff
.equ	OTP_DBG_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_DBG_CUSTOMER_RMA_FLAG
# Description : The chip is in RMA mode
.equ	OTP_DBG_CUSTOMER_RMA_FLAG_BITS, 0x00001000
.equ	OTP_DBG_CUSTOMER_RMA_FLAG_MSB, 12
.equ	OTP_DBG_CUSTOMER_RMA_FLAG_LSB, 12
# -----------------------------------------------------------------------------
# Field       : OTP_DBG_PSM_STATE
# Description : Monitor the PSM FSM's state
.equ	OTP_DBG_PSM_STATE_BITS, 0x000000f0
.equ	OTP_DBG_PSM_STATE_MSB, 7
.equ	OTP_DBG_PSM_STATE_LSB, 4
# -----------------------------------------------------------------------------
# Field       : OTP_DBG_ROSC_UP
# Description : Ring oscillator is up and running
.equ	OTP_DBG_ROSC_UP_BITS, 0x00000008
.equ	OTP_DBG_ROSC_UP_MSB, 3
.equ	OTP_DBG_ROSC_UP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : OTP_DBG_ROSC_UP_SEEN
# Description : Ring oscillator was seen up and running
.equ	OTP_DBG_ROSC_UP_SEEN_RESET, 0x0
.equ	OTP_DBG_ROSC_UP_SEEN_BITS, 0x00000004
.equ	OTP_DBG_ROSC_UP_SEEN_MSB, 2
.equ	OTP_DBG_ROSC_UP_SEEN_LSB, 2
# -----------------------------------------------------------------------------
# Field       : OTP_DBG_BOOT_DONE
# Description : PSM boot done status flag
.equ	OTP_DBG_BOOT_DONE_BITS, 0x00000002
.equ	OTP_DBG_BOOT_DONE_MSB, 1
.equ	OTP_DBG_BOOT_DONE_LSB, 1
# -----------------------------------------------------------------------------
# Field       : OTP_DBG_PSM_DONE
# Description : PSM done status flag
.equ	OTP_DBG_PSM_DONE_BITS, 0x00000001
.equ	OTP_DBG_PSM_DONE_MSB, 0
.equ	OTP_DBG_PSM_DONE_LSB, 0
# =============================================================================
# Register    : OTP_BIST
# Description : During BIST, count address locations that have at least one
#               leaky bit
.equ	OTP_BIST_OFFSET, 0x00000134
.equ	OTP_BIST_BITS, 0x7fff1fff
.equ	OTP_BIST_RESET, 0x0fff0000
# -----------------------------------------------------------------------------
# Field       : OTP_BIST_CNT_FAIL
# Description : Flag if the count of address locations with at least one leaky
#               bit exceeds cnt_max
.equ	OTP_BIST_CNT_FAIL_BITS, 0x40000000
.equ	OTP_BIST_CNT_FAIL_MSB, 30
.equ	OTP_BIST_CNT_FAIL_LSB, 30
# -----------------------------------------------------------------------------
# Field       : OTP_BIST_CNT_CLR
# Description : Clear counter before use
.equ	OTP_BIST_CNT_CLR_RESET, 0x0
.equ	OTP_BIST_CNT_CLR_BITS, 0x20000000
.equ	OTP_BIST_CNT_CLR_MSB, 29
.equ	OTP_BIST_CNT_CLR_LSB, 29
# -----------------------------------------------------------------------------
# Field       : OTP_BIST_CNT_ENA
# Description : Enable the counter before the BIST function is initiated
.equ	OTP_BIST_CNT_ENA_RESET, 0x0
.equ	OTP_BIST_CNT_ENA_BITS, 0x10000000
.equ	OTP_BIST_CNT_ENA_MSB, 28
.equ	OTP_BIST_CNT_ENA_LSB, 28
# -----------------------------------------------------------------------------
# Field       : OTP_BIST_CNT_MAX
# Description : The cnt_fail flag will be set if the number of leaky locations
#               exceeds this number
.equ	OTP_BIST_CNT_MAX_RESET, 0xfff
.equ	OTP_BIST_CNT_MAX_BITS, 0x0fff0000
.equ	OTP_BIST_CNT_MAX_MSB, 27
.equ	OTP_BIST_CNT_MAX_LSB, 16
# -----------------------------------------------------------------------------
# Field       : OTP_BIST_CNT
# Description : Number of locations that have at least one leaky bit. Note:
#               This count is true only if the BIST was initiated without the
