konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/otp.inc
#               fix option.
.equ	OTP_BIST_CNT_BITS, 0x00001fff
.equ	OTP_BIST_CNT_MSB, 12
.equ	OTP_BIST_CNT_LSB, 0
# =============================================================================
# Register    : OTP_CRT_KEY_W0
# Description : Word 0 (bits 31..0) of the key. Write only, read returns 0x0
.equ	OTP_CRT_KEY_W0_OFFSET, 0x00000138
.equ	OTP_CRT_KEY_W0_BITS, 0xffffffff
.equ	OTP_CRT_KEY_W0_RESET, 0x00000000
.equ	OTP_CRT_KEY_W0_MSB, 31
.equ	OTP_CRT_KEY_W0_LSB, 0
# =============================================================================
# Register    : OTP_CRT_KEY_W1
# Description : Word 1 (bits 63..32) of the key. Write only, read returns 0x0
.equ	OTP_CRT_KEY_W1_OFFSET, 0x0000013c
.equ	OTP_CRT_KEY_W1_BITS, 0xffffffff
.equ	OTP_CRT_KEY_W1_RESET, 0x00000000
.equ	OTP_CRT_KEY_W1_MSB, 31
.equ	OTP_CRT_KEY_W1_LSB, 0
# =============================================================================
# Register    : OTP_CRT_KEY_W2
# Description : Word 2 (bits 95..64) of the key. Write only, read returns 0x0
.equ	OTP_CRT_KEY_W2_OFFSET, 0x00000140
.equ	OTP_CRT_KEY_W2_BITS, 0xffffffff
.equ	OTP_CRT_KEY_W2_RESET, 0x00000000
.equ	OTP_CRT_KEY_W2_MSB, 31
.equ	OTP_CRT_KEY_W2_LSB, 0
# =============================================================================
# Register    : OTP_CRT_KEY_W3
# Description : Word 3 (bits 127..96) of the key. Write only, read returns 0x0
.equ	OTP_CRT_KEY_W3_OFFSET, 0x00000144
.equ	OTP_CRT_KEY_W3_BITS, 0xffffffff
.equ	OTP_CRT_KEY_W3_RESET, 0x00000000
.equ	OTP_CRT_KEY_W3_MSB, 31
.equ	OTP_CRT_KEY_W3_LSB, 0
# =============================================================================
# Register    : OTP_CRITICAL
# Description : Quickly check values of critical flags read during boot up
.equ	OTP_CRITICAL_OFFSET, 0x00000148
.equ	OTP_CRITICAL_BITS, 0x0003007f
.equ	OTP_CRITICAL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_CRITICAL_RISCV_DISABLE
.equ	OTP_CRITICAL_RISCV_DISABLE_RESET, 0x0
.equ	OTP_CRITICAL_RISCV_DISABLE_BITS, 0x00020000
.equ	OTP_CRITICAL_RISCV_DISABLE_MSB, 17
.equ	OTP_CRITICAL_RISCV_DISABLE_LSB, 17
# -----------------------------------------------------------------------------
# Field       : OTP_CRITICAL_ARM_DISABLE
.equ	OTP_CRITICAL_ARM_DISABLE_RESET, 0x0
.equ	OTP_CRITICAL_ARM_DISABLE_BITS, 0x00010000
.equ	OTP_CRITICAL_ARM_DISABLE_MSB, 16
.equ	OTP_CRITICAL_ARM_DISABLE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : OTP_CRITICAL_GLITCH_DETECTOR_SENS
.equ	OTP_CRITICAL_GLITCH_DETECTOR_SENS_RESET, 0x0
.equ	OTP_CRITICAL_GLITCH_DETECTOR_SENS_BITS, 0x00000060
.equ	OTP_CRITICAL_GLITCH_DETECTOR_SENS_MSB, 6
.equ	OTP_CRITICAL_GLITCH_DETECTOR_SENS_LSB, 5
# -----------------------------------------------------------------------------
# Field       : OTP_CRITICAL_GLITCH_DETECTOR_ENABLE
.equ	OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_RESET, 0x0
.equ	OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_BITS, 0x00000010
.equ	OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_MSB, 4
.equ	OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_LSB, 4
# -----------------------------------------------------------------------------
# Field       : OTP_CRITICAL_DEFAULT_ARCHSEL
.equ	OTP_CRITICAL_DEFAULT_ARCHSEL_RESET, 0x0
.equ	OTP_CRITICAL_DEFAULT_ARCHSEL_BITS, 0x00000008
.equ	OTP_CRITICAL_DEFAULT_ARCHSEL_MSB, 3
.equ	OTP_CRITICAL_DEFAULT_ARCHSEL_LSB, 3
# -----------------------------------------------------------------------------
# Field       : OTP_CRITICAL_DEBUG_DISABLE
.equ	OTP_CRITICAL_DEBUG_DISABLE_RESET, 0x0
.equ	OTP_CRITICAL_DEBUG_DISABLE_BITS, 0x00000004
.equ	OTP_CRITICAL_DEBUG_DISABLE_MSB, 2
.equ	OTP_CRITICAL_DEBUG_DISABLE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : OTP_CRITICAL_SECURE_DEBUG_DISABLE
.equ	OTP_CRITICAL_SECURE_DEBUG_DISABLE_RESET, 0x0
.equ	OTP_CRITICAL_SECURE_DEBUG_DISABLE_BITS, 0x00000002
.equ	OTP_CRITICAL_SECURE_DEBUG_DISABLE_MSB, 1
.equ	OTP_CRITICAL_SECURE_DEBUG_DISABLE_LSB, 1
# -----------------------------------------------------------------------------
# Field       : OTP_CRITICAL_SECURE_BOOT_ENABLE
.equ	OTP_CRITICAL_SECURE_BOOT_ENABLE_RESET, 0x0
.equ	OTP_CRITICAL_SECURE_BOOT_ENABLE_BITS, 0x00000001
.equ	OTP_CRITICAL_SECURE_BOOT_ENABLE_MSB, 0
.equ	OTP_CRITICAL_SECURE_BOOT_ENABLE_LSB, 0
# =============================================================================
# Register    : OTP_KEY_VALID
# Description : Which keys were valid (enrolled) at boot time
.equ	OTP_KEY_VALID_OFFSET, 0x0000014c
.equ	OTP_KEY_VALID_BITS, 0x000000ff
.equ	OTP_KEY_VALID_RESET, 0x00000000
.equ	OTP_KEY_VALID_MSB, 7
.equ	OTP_KEY_VALID_LSB, 0
# =============================================================================
# Register    : OTP_DEBUGEN
# Description : Enable a debug feature that has been disabled. Debug features
#               are disabled if one of the relevant critical boot flags is set
#               in OTP (DEBUG_DISABLE or SECURE_DEBUG_DISABLE), OR if a debug
#               key is marked valid in OTP, and the matching key value has not
#               been supplied over SWD.
#
#               Specifically:
#
#               - The DEBUG_DISABLE flag disables all debug features. This can
#               be fully overridden by setting all bits of this register.
#
#               - The SECURE_DEBUG_DISABLE flag disables secure processor
#               debug. This can be fully overridden by setting the PROC0_SECURE
#               and PROC1_SECURE bits of this register.
#
#               - If a single debug key has been registered, and no matching
#               key value has been supplied over SWD, then all debug features
#               are disabled. This can be fully overridden by setting all bits
#               of this register.
#
#               - If both debug keys have been registered, and the Non-secure
#               key's value (key 6) has been supplied over SWD, secure
#               processor debug is disabled. This can be fully overridden by
#               setting the PROC0_SECURE and PROC1_SECURE bits of this
#               register.
#
#               - If both debug keys have been registered, and the Secure key's
#               value (key 5) has been supplied over SWD, then no debug
#               features are disabled by the key mechanism. However, note that
#               in this case debug features may still be disabled by the
#               critical boot flags.
.equ	OTP_DEBUGEN_OFFSET, 0x00000150
.equ	OTP_DEBUGEN_BITS, 0x0000010f
.equ	OTP_DEBUGEN_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_DEBUGEN_MISC
# Description : Enable other debug components. Specifically, the CTI, and the
#               APB-AP used to access the RISC-V Debug Module.
#
#               These components are disabled by default if either of the debug
#               disable critical flags is set, or if at least one debug key has
#               been enrolled and the least secure of these enrolled key values
#               has not been provided over SWD.
.equ	OTP_DEBUGEN_MISC_RESET, 0x0
.equ	OTP_DEBUGEN_MISC_BITS, 0x00000100
.equ	OTP_DEBUGEN_MISC_MSB, 8
.equ	OTP_DEBUGEN_MISC_LSB, 8
# -----------------------------------------------------------------------------
# Field       : OTP_DEBUGEN_PROC1_SECURE
# Description : Permit core 1's Mem-AP to generate Secure accesses, assuming it
#               is enabled at all. Also enable secure debug of core 1 (SPIDEN
#               and SPNIDEN).
#
#               Secure debug of core 1 is disabled by default if the secure
#               debug disable critical flag is set, or if at least one debug
#               key has been enrolled and the most secure of these enrolled key
#               values not yet provided over SWD.
.equ	OTP_DEBUGEN_PROC1_SECURE_RESET, 0x0
.equ	OTP_DEBUGEN_PROC1_SECURE_BITS, 0x00000008
.equ	OTP_DEBUGEN_PROC1_SECURE_MSB, 3
.equ	OTP_DEBUGEN_PROC1_SECURE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : OTP_DEBUGEN_PROC1
# Description : Enable core 1's Mem-AP if it is currently disabled.
#
#               The Mem-AP is disabled by default if either of the debug
#               disable critical flags is set, or if at least one debug key has
#               been enrolled and the least secure of these enrolled key values
#               has not been provided over SWD.
.equ	OTP_DEBUGEN_PROC1_RESET, 0x0
.equ	OTP_DEBUGEN_PROC1_BITS, 0x00000004
.equ	OTP_DEBUGEN_PROC1_MSB, 2
.equ	OTP_DEBUGEN_PROC1_LSB, 2
# -----------------------------------------------------------------------------
# Field       : OTP_DEBUGEN_PROC0_SECURE
# Description : Permit core 0's Mem-AP to generate Secure accesses, assuming it
#               is enabled at all. Also enable secure debug of core 0 (SPIDEN
#               and SPNIDEN).
#
#               Secure debug of core 0 is disabled by default if the secure
#               debug disable critical flag is set, or if at least one debug
#               key has been enrolled and the most secure of these enrolled key
#               values not yet provided over SWD.
#
#               Note also that core Mem-APs are unconditionally disabled when a
#               core is switched to RISC-V mode (by setting the ARCHSEL bit and
#               performing a warm reset of the core).
.equ	OTP_DEBUGEN_PROC0_SECURE_RESET, 0x0
.equ	OTP_DEBUGEN_PROC0_SECURE_BITS, 0x00000002
.equ	OTP_DEBUGEN_PROC0_SECURE_MSB, 1
.equ	OTP_DEBUGEN_PROC0_SECURE_LSB, 1
# -----------------------------------------------------------------------------
# Field       : OTP_DEBUGEN_PROC0
# Description : Enable core 0's Mem-AP if it is currently disabled.
#
#               The Mem-AP is disabled by default if either of the debug
#               disable critical flags is set, or if at least one debug key has
#               been enrolled and the least secure of these enrolled key values
#               has not been provided over SWD.
#
#               Note also that core Mem-APs are unconditionally disabled when a
#               core is switched to RISC-V mode (by setting the ARCHSEL bit and
#               performing a warm reset of the core).
.equ	OTP_DEBUGEN_PROC0_RESET, 0x0
.equ	OTP_DEBUGEN_PROC0_BITS, 0x00000001
.equ	OTP_DEBUGEN_PROC0_MSB, 0
.equ	OTP_DEBUGEN_PROC0_LSB, 0
# =============================================================================
# Register    : OTP_DEBUGEN_LOCK
# Description : Write 1s to lock corresponding bits in DEBUGEN. This register
#               is reset by the processor cold reset.
.equ	OTP_DEBUGEN_LOCK_OFFSET, 0x00000154
.equ	OTP_DEBUGEN_LOCK_BITS, 0x0000010f
.equ	OTP_DEBUGEN_LOCK_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_DEBUGEN_LOCK_MISC
# Description : Write 1 to lock the MISC bit of DEBUGEN. Can't be cleared once
#               set.
.equ	OTP_DEBUGEN_LOCK_MISC_RESET, 0x0
.equ	OTP_DEBUGEN_LOCK_MISC_BITS, 0x00000100
.equ	OTP_DEBUGEN_LOCK_MISC_MSB, 8
.equ	OTP_DEBUGEN_LOCK_MISC_LSB, 8
# -----------------------------------------------------------------------------
# Field       : OTP_DEBUGEN_LOCK_PROC1_SECURE
# Description : Write 1 to lock the PROC1_SECURE bit of DEBUGEN. Can't be
#               cleared once set.
.equ	OTP_DEBUGEN_LOCK_PROC1_SECURE_RESET, 0x0
.equ	OTP_DEBUGEN_LOCK_PROC1_SECURE_BITS, 0x00000008
.equ	OTP_DEBUGEN_LOCK_PROC1_SECURE_MSB, 3
.equ	OTP_DEBUGEN_LOCK_PROC1_SECURE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : OTP_DEBUGEN_LOCK_PROC1
# Description : Write 1 to lock the PROC1 bit of DEBUGEN. Can't be cleared once
#               set.
.equ	OTP_DEBUGEN_LOCK_PROC1_RESET, 0x0
.equ	OTP_DEBUGEN_LOCK_PROC1_BITS, 0x00000004
.equ	OTP_DEBUGEN_LOCK_PROC1_MSB, 2
.equ	OTP_DEBUGEN_LOCK_PROC1_LSB, 2
# -----------------------------------------------------------------------------
# Field       : OTP_DEBUGEN_LOCK_PROC0_SECURE
# Description : Write 1 to lock the PROC0_SECURE bit of DEBUGEN. Can't be
#               cleared once set.
.equ	OTP_DEBUGEN_LOCK_PROC0_SECURE_RESET, 0x0
.equ	OTP_DEBUGEN_LOCK_PROC0_SECURE_BITS, 0x00000002
.equ	OTP_DEBUGEN_LOCK_PROC0_SECURE_MSB, 1
.equ	OTP_DEBUGEN_LOCK_PROC0_SECURE_LSB, 1
# -----------------------------------------------------------------------------
# Field       : OTP_DEBUGEN_LOCK_PROC0
# Description : Write 1 to lock the PROC0 bit of DEBUGEN. Can't be cleared once
#               set.
.equ	OTP_DEBUGEN_LOCK_PROC0_RESET, 0x0
.equ	OTP_DEBUGEN_LOCK_PROC0_BITS, 0x00000001
.equ	OTP_DEBUGEN_LOCK_PROC0_MSB, 0
.equ	OTP_DEBUGEN_LOCK_PROC0_LSB, 0
# =============================================================================
# Register    : OTP_ARCHSEL
# Description : Architecture select (Arm/RISC-V). The default and allowable
#               values of this register are constrained by the critical boot
#               flags.
#
#               This register is reset by the earliest reset in the switched
#               core power domain (before a processor cold reset).
#
#               Cores sample their architecture select signal on a warm reset.
#               The source of the warm reset could be the system power-up state
#               machine, the watchdog timer, Arm SYSRESETREQ or from RISC-V
#               hartresetreq.
#
#               Note that when an Arm core is deselected, its cold reset domain
#               is also held in reset, since in particular the SYSRESETREQ bit
#               becomes inaccessible once the core is deselected. Note also the
#               RISC-V cores do not have a cold reset domain, since their
#               corresponding controls are located in the Debug Module.
.equ	OTP_ARCHSEL_OFFSET, 0x00000158
.equ	OTP_ARCHSEL_BITS, 0x00000003
.equ	OTP_ARCHSEL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_ARCHSEL_CORE1
# Description : Select architecture for core 1.
#               0x0 -> Switch core 1 to Arm (Cortex-M33)
#               0x1 -> Switch core 1 to RISC-V (Hazard3)
.equ	OTP_ARCHSEL_CORE1_RESET, 0x0
.equ	OTP_ARCHSEL_CORE1_BITS, 0x00000002
.equ	OTP_ARCHSEL_CORE1_MSB, 1
.equ	OTP_ARCHSEL_CORE1_LSB, 1
.equ	OTP_ARCHSEL_CORE1_VALUE_ARM, 0x0
.equ	OTP_ARCHSEL_CORE1_VALUE_RISCV, 0x1
# -----------------------------------------------------------------------------
# Field       : OTP_ARCHSEL_CORE0
# Description : Select architecture for core 0.
#               0x0 -> Switch core 0 to Arm (Cortex-M33)
#               0x1 -> Switch core 0 to RISC-V (Hazard3)
.equ	OTP_ARCHSEL_CORE0_RESET, 0x0
.equ	OTP_ARCHSEL_CORE0_BITS, 0x00000001
.equ	OTP_ARCHSEL_CORE0_MSB, 0
.equ	OTP_ARCHSEL_CORE0_LSB, 0
.equ	OTP_ARCHSEL_CORE0_VALUE_ARM, 0x0
.equ	OTP_ARCHSEL_CORE0_VALUE_RISCV, 0x1
# =============================================================================
# Register    : OTP_ARCHSEL_STATUS
# Description : Get the current architecture select state of each core. Cores
#               sample the current value of the ARCHSEL register when their
#               warm reset is released, at which point the corresponding bit in
#               this register will also update.
.equ	OTP_ARCHSEL_STATUS_OFFSET, 0x0000015c
.equ	OTP_ARCHSEL_STATUS_BITS, 0x00000003
.equ	OTP_ARCHSEL_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_ARCHSEL_STATUS_CORE1
# Description : Current architecture for core 0. Updated on processor warm
#               reset.
#               0x0 -> Core 1 is currently Arm (Cortex-M33)
#               0x1 -> Core 1 is currently RISC-V (Hazard3)
.equ	OTP_ARCHSEL_STATUS_CORE1_RESET, 0x0
.equ	OTP_ARCHSEL_STATUS_CORE1_BITS, 0x00000002
.equ	OTP_ARCHSEL_STATUS_CORE1_MSB, 1
.equ	OTP_ARCHSEL_STATUS_CORE1_LSB, 1
.equ	OTP_ARCHSEL_STATUS_CORE1_VALUE_ARM, 0x0
.equ	OTP_ARCHSEL_STATUS_CORE1_VALUE_RISCV, 0x1
# -----------------------------------------------------------------------------
# Field       : OTP_ARCHSEL_STATUS_CORE0
# Description : Current architecture for core 0. Updated on processor warm
#               reset.
#               0x0 -> Core 0 is currently Arm (Cortex-M33)
#               0x1 -> Core 0 is currently RISC-V (Hazard3)
.equ	OTP_ARCHSEL_STATUS_CORE0_RESET, 0x0
.equ	OTP_ARCHSEL_STATUS_CORE0_BITS, 0x00000001
.equ	OTP_ARCHSEL_STATUS_CORE0_MSB, 0
.equ	OTP_ARCHSEL_STATUS_CORE0_LSB, 0
.equ	OTP_ARCHSEL_STATUS_CORE0_VALUE_ARM, 0x0
.equ	OTP_ARCHSEL_STATUS_CORE0_VALUE_RISCV, 0x1
# =============================================================================
# Register    : OTP_BOOTDIS
# Description : Tell the bootrom to ignore scratch register boot vectors (both
#               power manager and watchdog) on the next power up.
#
#               If an early boot stage has soft-locked some OTP pages in order
#               to protect their contents from later stages, there is a risk
#               that Secure code running at a later stage can unlock the pages
#               by performing a watchdog reset that resets the OTP.
#
#               This register can be used to ensure that the bootloader runs as
#               normal on the next power up, preventing Secure code at a later
#               stage from accessing OTP in its unlocked state.
#
#               Should be used in conjunction with the power manager BOOTDIS
#               register.
.equ	OTP_BOOTDIS_OFFSET, 0x00000160
.equ	OTP_BOOTDIS_BITS, 0x00000003
.equ	OTP_BOOTDIS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_BOOTDIS_NEXT
# Description : This flag always ORs writes into its current contents. It can
#               be set but not cleared by software.
#
#               The BOOTDIS_NEXT bit is OR'd into the BOOTDIS_NOW bit when the
#               core is powered down. Simultaneously, the BOOTDIS_NEXT bit is
#               cleared. Setting this bit means that the boot scratch registers
#               will be ignored following the next core power down.
#
#               This flag should be set by an early boot stage that has soft-
#               locked OTP pages, to prevent later stages from unlocking it via
#               watchdog reset.
.equ	OTP_BOOTDIS_NEXT_RESET, 0x0
.equ	OTP_BOOTDIS_NEXT_BITS, 0x00000002
.equ	OTP_BOOTDIS_NEXT_MSB, 1
.equ	OTP_BOOTDIS_NEXT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : OTP_BOOTDIS_NOW
# Description : When the core is powered down, the current value of
#               BOOTDIS_NEXT is OR'd into BOOTDIS_NOW, and BOOTDIS_NEXT is
#               cleared.
#
#               The bootrom checks this flag before reading the boot scratch
#               registers. If it is set, the bootrom clears it, and ignores the
#               BOOT registers. This prevents Secure software from diverting
#               the boot path before a bootloader has had the chance to soft
#               lock OTP pages containing sensitive data.
.equ	OTP_BOOTDIS_NOW_RESET, 0x0
.equ	OTP_BOOTDIS_NOW_BITS, 0x00000001
.equ	OTP_BOOTDIS_NOW_MSB, 0
.equ	OTP_BOOTDIS_NOW_LSB, 0
# =============================================================================
# Register    : OTP_INTR
# Description : Raw Interrupts
.equ	OTP_INTR_OFFSET, 0x00000164
.equ	OTP_INTR_BITS, 0x0000001f
.equ	OTP_INTR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_INTR_APB_RD_NSEC_FAIL
.equ	OTP_INTR_APB_RD_NSEC_FAIL_RESET, 0x0
.equ	OTP_INTR_APB_RD_NSEC_FAIL_BITS, 0x00000010
.equ	OTP_INTR_APB_RD_NSEC_FAIL_MSB, 4
.equ	OTP_INTR_APB_RD_NSEC_FAIL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : OTP_INTR_APB_RD_SEC_FAIL
.equ	OTP_INTR_APB_RD_SEC_FAIL_RESET, 0x0
.equ	OTP_INTR_APB_RD_SEC_FAIL_BITS, 0x00000008
.equ	OTP_INTR_APB_RD_SEC_FAIL_MSB, 3
.equ	OTP_INTR_APB_RD_SEC_FAIL_LSB, 3
# -----------------------------------------------------------------------------
# Field       : OTP_INTR_APB_DCTRL_FAIL
.equ	OTP_INTR_APB_DCTRL_FAIL_RESET, 0x0
.equ	OTP_INTR_APB_DCTRL_FAIL_BITS, 0x00000004
.equ	OTP_INTR_APB_DCTRL_FAIL_MSB, 2
.equ	OTP_INTR_APB_DCTRL_FAIL_LSB, 2
# -----------------------------------------------------------------------------
# Field       : OTP_INTR_SBPI_WR_FAIL
.equ	OTP_INTR_SBPI_WR_FAIL_RESET, 0x0
.equ	OTP_INTR_SBPI_WR_FAIL_BITS, 0x00000002
.equ	OTP_INTR_SBPI_WR_FAIL_MSB, 1
.equ	OTP_INTR_SBPI_WR_FAIL_LSB, 1
# -----------------------------------------------------------------------------
# Field       : OTP_INTR_SBPI_FLAG_N
.equ	OTP_INTR_SBPI_FLAG_N_RESET, 0x0
.equ	OTP_INTR_SBPI_FLAG_N_BITS, 0x00000001
.equ	OTP_INTR_SBPI_FLAG_N_MSB, 0
.equ	OTP_INTR_SBPI_FLAG_N_LSB, 0
# =============================================================================
# Register    : OTP_INTE
# Description : Interrupt Enable
.equ	OTP_INTE_OFFSET, 0x00000168
.equ	OTP_INTE_BITS, 0x0000001f
.equ	OTP_INTE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_INTE_APB_RD_NSEC_FAIL
.equ	OTP_INTE_APB_RD_NSEC_FAIL_RESET, 0x0
.equ	OTP_INTE_APB_RD_NSEC_FAIL_BITS, 0x00000010
.equ	OTP_INTE_APB_RD_NSEC_FAIL_MSB, 4
.equ	OTP_INTE_APB_RD_NSEC_FAIL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : OTP_INTE_APB_RD_SEC_FAIL
.equ	OTP_INTE_APB_RD_SEC_FAIL_RESET, 0x0
.equ	OTP_INTE_APB_RD_SEC_FAIL_BITS, 0x00000008
.equ	OTP_INTE_APB_RD_SEC_FAIL_MSB, 3
.equ	OTP_INTE_APB_RD_SEC_FAIL_LSB, 3
# -----------------------------------------------------------------------------
# Field       : OTP_INTE_APB_DCTRL_FAIL
.equ	OTP_INTE_APB_DCTRL_FAIL_RESET, 0x0
.equ	OTP_INTE_APB_DCTRL_FAIL_BITS, 0x00000004
.equ	OTP_INTE_APB_DCTRL_FAIL_MSB, 2
.equ	OTP_INTE_APB_DCTRL_FAIL_LSB, 2
# -----------------------------------------------------------------------------
# Field       : OTP_INTE_SBPI_WR_FAIL
.equ	OTP_INTE_SBPI_WR_FAIL_RESET, 0x0
.equ	OTP_INTE_SBPI_WR_FAIL_BITS, 0x00000002
.equ	OTP_INTE_SBPI_WR_FAIL_MSB, 1
.equ	OTP_INTE_SBPI_WR_FAIL_LSB, 1
# -----------------------------------------------------------------------------
# Field       : OTP_INTE_SBPI_FLAG_N
.equ	OTP_INTE_SBPI_FLAG_N_RESET, 0x0
.equ	OTP_INTE_SBPI_FLAG_N_BITS, 0x00000001
.equ	OTP_INTE_SBPI_FLAG_N_MSB, 0
.equ	OTP_INTE_SBPI_FLAG_N_LSB, 0
# =============================================================================
# Register    : OTP_INTF
# Description : Interrupt Force
.equ	OTP_INTF_OFFSET, 0x0000016c
.equ	OTP_INTF_BITS, 0x0000001f
.equ	OTP_INTF_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_INTF_APB_RD_NSEC_FAIL
.equ	OTP_INTF_APB_RD_NSEC_FAIL_RESET, 0x0
.equ	OTP_INTF_APB_RD_NSEC_FAIL_BITS, 0x00000010
.equ	OTP_INTF_APB_RD_NSEC_FAIL_MSB, 4
.equ	OTP_INTF_APB_RD_NSEC_FAIL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : OTP_INTF_APB_RD_SEC_FAIL
.equ	OTP_INTF_APB_RD_SEC_FAIL_RESET, 0x0
.equ	OTP_INTF_APB_RD_SEC_FAIL_BITS, 0x00000008
.equ	OTP_INTF_APB_RD_SEC_FAIL_MSB, 3
.equ	OTP_INTF_APB_RD_SEC_FAIL_LSB, 3
# -----------------------------------------------------------------------------
# Field       : OTP_INTF_APB_DCTRL_FAIL
.equ	OTP_INTF_APB_DCTRL_FAIL_RESET, 0x0
.equ	OTP_INTF_APB_DCTRL_FAIL_BITS, 0x00000004
.equ	OTP_INTF_APB_DCTRL_FAIL_MSB, 2
.equ	OTP_INTF_APB_DCTRL_FAIL_LSB, 2
# -----------------------------------------------------------------------------
# Field       : OTP_INTF_SBPI_WR_FAIL
.equ	OTP_INTF_SBPI_WR_FAIL_RESET, 0x0
.equ	OTP_INTF_SBPI_WR_FAIL_BITS, 0x00000002
.equ	OTP_INTF_SBPI_WR_FAIL_MSB, 1
.equ	OTP_INTF_SBPI_WR_FAIL_LSB, 1
# -----------------------------------------------------------------------------
# Field       : OTP_INTF_SBPI_FLAG_N
.equ	OTP_INTF_SBPI_FLAG_N_RESET, 0x0
.equ	OTP_INTF_SBPI_FLAG_N_BITS, 0x00000001
