konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/otp.inc
.equ	OTP_INTF_SBPI_FLAG_N_MSB, 0
.equ	OTP_INTF_SBPI_FLAG_N_LSB, 0
# =============================================================================
# Register    : OTP_INTS
# Description : Interrupt status after masking & forcing
.equ	OTP_INTS_OFFSET, 0x00000170
.equ	OTP_INTS_BITS, 0x0000001f
.equ	OTP_INTS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : OTP_INTS_APB_RD_NSEC_FAIL
.equ	OTP_INTS_APB_RD_NSEC_FAIL_RESET, 0x0
.equ	OTP_INTS_APB_RD_NSEC_FAIL_BITS, 0x00000010
.equ	OTP_INTS_APB_RD_NSEC_FAIL_MSB, 4
.equ	OTP_INTS_APB_RD_NSEC_FAIL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : OTP_INTS_APB_RD_SEC_FAIL
.equ	OTP_INTS_APB_RD_SEC_FAIL_RESET, 0x0
.equ	OTP_INTS_APB_RD_SEC_FAIL_BITS, 0x00000008
.equ	OTP_INTS_APB_RD_SEC_FAIL_MSB, 3
.equ	OTP_INTS_APB_RD_SEC_FAIL_LSB, 3
# -----------------------------------------------------------------------------
# Field       : OTP_INTS_APB_DCTRL_FAIL
.equ	OTP_INTS_APB_DCTRL_FAIL_RESET, 0x0
.equ	OTP_INTS_APB_DCTRL_FAIL_BITS, 0x00000004
.equ	OTP_INTS_APB_DCTRL_FAIL_MSB, 2
.equ	OTP_INTS_APB_DCTRL_FAIL_LSB, 2
# -----------------------------------------------------------------------------
# Field       : OTP_INTS_SBPI_WR_FAIL
.equ	OTP_INTS_SBPI_WR_FAIL_RESET, 0x0
.equ	OTP_INTS_SBPI_WR_FAIL_BITS, 0x00000002
.equ	OTP_INTS_SBPI_WR_FAIL_MSB, 1
.equ	OTP_INTS_SBPI_WR_FAIL_LSB, 1
# -----------------------------------------------------------------------------
# Field       : OTP_INTS_SBPI_FLAG_N
.equ	OTP_INTS_SBPI_FLAG_N_RESET, 0x0
.equ	OTP_INTS_SBPI_FLAG_N_BITS, 0x00000001
.equ	OTP_INTS_SBPI_FLAG_N_MSB, 0
.equ	OTP_INTS_SBPI_FLAG_N_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_OTP_H
